# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

my_list = [-9, 4, 7, 3, 8, -6,]

sum_num = 0
for number in my_list:
    sum_num += number
print(sum_num)
