# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне - слева короткие слова дополняем символами пробела

# Исходные данные:
fruits = ["яблоко", "банан", "киви", "арбуз"]

# TODO: your code here

# Пример вывода:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Важно! Ваше решение должно работать с любыми корректными "исходными данными"
# Проверьте это, добавив или удалив несколько элементов списка

fruits.sort(key=len)
fruits[-1]
for i, fruit in enumerate(fruits, 1):   # РАСПАКОВКА КОРТЕЖА! начинает с 0 если не укажем иначе
    print(i,')',' '*(len(fruits[-1])-len(fruit)), fruit)
# TODO: your code here
